# Title Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..Title Property
Document Class See Also
---
The document's title.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string Title { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Title As String
	Get
```

Visual C++
---
```text
public:
property String^ Title {
	String^ get ();
}
```

# Remarks
Title is derived from the document's filename, not including the filename extension. Note that returned title will be defaulted if no document saved. Note that returned string may be empty if a document is detached. See IsDetached.
# See Also
Document Class
Autodesk.Revit.DB Namespace